In [74]:
import pandas as pd
import psycopg2
import sqlalchemy as sl

Підключення до бази даних

In [75]:
username = 'KhokMaksym'
password = '1234543'
database = 'Lab_2_DB'

engine = sl.create_engine(f'postgresql+psycopg2://{username}:{password}@localhost/{database}')

Запити до бази даних

In [105]:
query_1 = '''
select TRIM(city_state) as city_state, count(*) as customers_count from customers left join cities USING(city_name)
GROUP by city_state 
'''

query_2 = '''
select TRIM(sku) as sku, sum(total) as total_sum from orderitems
group by sku
'''

query_3 = '''
SELECT qty_ordered, total from orderitems 
where sku = 'MEFREL59AC079AE6C6F-L'
'''

Результати отримані по відповідним запитам

In [106]:
df_1 = pd.read_sql(query_1, con=engine)
df_1

  city_state  customers_count
0         DC                2
1         FL                1
2         OK                1
3         LA                1
4         AZ                2

In [107]:
df_2 = pd.read_sql(query_2, con=engine)
df_2

                     sku  total_sum
0    HASONC59AC64DFADA78     229.58
1    MATBIS59ACAAF2C617C     132.99
2    APPHED59D47BB72D66F     108.38
3  MEFREL59AC079AE6C6F-L    3822.99
4     oasis_Oasis-064-36    1827.49

In [108]:
df_3 = pd.read_sql(query_3, con=engine)
df_3

   qty_ordered    total
0            2    22.50
1           41  1800.00
2           63  2000.49

Збереження отриманих результатів

In [111]:
results = [df_1, df_2, df_3]
%store results

Stored 'results' (list)